JeonghunLee/wifisniffer/sdkconfig.defaults
# ESP32-S3 WiFi Sniffer Configuration

# Target device
CONFIG_IDF_TARGET="esp32s3"

# WiFi Configuration
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Serial console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600

# Enable promiscuous mode filter
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
